note-linux-上古神器awk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-26 Fri 14:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>上古神器 awk</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">上古神器 awk</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbceca15">上古神器-awk</a>
<ul>
<li><a href="#orge9eea8a">awk syntax</a></li>
<li><a href="#org5dd1311">awk 常用命令</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbceca15" class="outline-2">
<h2 id="orgbceca15">上古神器-awk</h2>
<div class="outline-text-2" id="text-orgbceca15">
</div>
<div id="outline-container-orge9eea8a" class="outline-3">
<h3 id="orge9eea8a">awk syntax</h3>
<div class="outline-text-3" id="text-orge9eea8a">
<p>
最简单的awk 程序是一个或多个模式–动作语句构成的序列:
</p>
<pre class="example">
pattern { action }
pattern { action }
</pre>
<p>
简单的单行awk语句可以直接执行
</p>
<pre class="example">
awk pattern {action} filename  
</pre>
<p>
如果复杂点的awk语句,可以写入文件内,
</p>
<pre class="example">
awk -f awk.sh awk_txt
</pre>
<p>
测试数据:
</p>
<pre class="example">
USSR 8649 275 Asia
Canada 3852 25 North America
China 3705 1032 Asia                                                                                                                                                                     
USA 3615 237 North America
Brazil 3286 134 South America
India 1267 746 Asia
Mexico 762 78 North America
France 211 55 Europe
Japan 144 120 Asia
Germany 96 61 Europe
England 94 56 Europe
</pre>
</div>
<div id="outline-container-orgdd790f7" class="outline-4">
<h4 id="orgdd790f7">pattern</h4>
<div class="outline-text-4" id="text-orgdd790f7">
<p>
模式汇总
</p>
<ol class="org-ol">
<li><p>
BEGIN{ statements}
</p>

<p>
在输入被读取之前, statements 执行一次.
</p></li>
<li><p>
END{ statements}
</p>

<p>
当所有输入被读取完毕之后, statements 执行一次.
</p></li>
<li><p>
expression{ statements}
</p>

<p>
每碰到一个使expression 为真的输入行, statements 就执行. expression 为真指的是其值非零或非空.
</p></li>
<li><p>
regular expression { statements}
</p>

<p>
当碰到这样一个输入行时, statements 就执行: 输入行含有一段字符串, 而该字符串可以被regular expression 匹配.
</p></li>
<li><p>
compound pattern { statements}
</p>

<p>
一个复合模式将表达式用&amp;&amp;(AND), ||(OR), !(NOT), 以及括号组合起来; 当compound pattern为真时, statements 执行.
</p></li>
<li><p>
pattern1, pattern2 { statements}
</p>

<p>
一个范围模式匹配多个输入行, 这些输入行从匹配pattern1 的行开始, 到匹配pattern2 的行结束(包括这两行), 对这其中的每一行执行statements
</p></li>
</ol>

<p>
BEGIN 与END 不与其他模式组合. 一个范围模式不能是其他模式的一部分. BEGIN 与END 是唯一两个不能省略动作的模式.
</p>
</div>
</div>
<div id="outline-container-orgc441a5b" class="outline-4">
<h4 id="orgc441a5b">action</h4>
<div class="outline-text-4" id="text-orgc441a5b">
<p>
动作中的语句可以包括:
</p>
<pre class="example">
expression, 包括常量, 变量, 赋值, 函数调用等等.
print expression-list
printf(format, expression-list)
if (expression) statements
if (expression) statements else statements
while (expression) statements
for (expression; expression; expression) statements
for (expression in array) statements
do statements while (expression)
break
continue
</pre>
<p>
awk作为一种编程语言,刚开始接触awk语句看得眼晕主要是不了解它的内置变量
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">变量</th>
<th scope="col" class="org-left">意义</th>
<th scope="col" class="org-left">默认值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ARGC</td>
<td class="org-left">命令行参数的个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">ARGV</td>
<td class="org-left">命令行参数数组</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FILENAME</td>
<td class="org-left">当前输入文件名</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FNR</td>
<td class="org-left">当前输入文件的记录个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">FS</td>
<td class="org-left">控制着输入行的字段分割符</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">NF</td>
<td class="org-left">当前记录的字段个数</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">NR</td>
<td class="org-left">到目前为止读的记录数量</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">OFMT</td>
<td class="org-left">数值的输出格式</td>
<td class="org-left">%.6g</td>
</tr>

<tr>
<td class="org-left">OFS</td>
<td class="org-left">输出字段分割符</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ORS</td>
<td class="org-left">输出的记录的分割符</td>
<td class="org-left">\n</td>
</tr>

<tr>
<td class="org-left">RLENGTH</td>
<td class="org-left">被函数match匹配的字符串的长度</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">RS</td>
<td class="org-left">控制着输入行的记录分割符"\n"</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">RSTART</td>
<td class="org-left">被函数match匹配的字符串的开始</td>
<td class="org-left">-</td>
</tr>

<tr>
<td class="org-left">SUBSEP</td>
<td class="org-left">下标分割符</td>
<td class="org-left">\034</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org5dd1311" class="outline-3">
<h3 id="org5dd1311">awk 常用命令</h3>
<div class="outline-text-3" id="text-org5dd1311">
<ol class="org-ol">
<li><p>
kill 进程
</p>

<p>
ps aux|grep test.py|awk '{print $2}'|xargs kill -9
</p></li>
<li><p>
两文件比较 取相同部分
</p>

<p>
awk -F ':' 'NR==FNR{a[$1]++}NR!=FNR{if($1 in a){print $i}}' 1 2 &gt;3
</p>

<p>
输出2在1中第一列相同的所有值
</p></li>
<li><p>
输出3文件内 大于10列
</p>

<p>
awk 'NF&gt;10 {print $i}' 3 &gt; 4
</p></li>
</ol>


<ol class="org-ol">
<li>删除重复行
awk '!($0 in array) { array[$0]; print}' temp</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>